import { changeModuleEEWidgetHeightHandler } from "../../utils/modules/moduleGlobalUtils"
import { showHideEEWidget } from "../../utils/modules/moduleGlobalUtils"
import { moduleStorage_preValueConfiguration } from "../../utils/modules/defaults/defaultModuleVariables"
export function hlween() {
    let lstorage_c_moduleHlweenPumkin = localStorage.getItem(moduleStorage_preValueConfiguration+'_hlweenPumpkin')
    const pumpkinId = 'pumpkin'
    const mainHtml = document.getElementsByTagName('main')[0]
    const configItemDesign = document.getElementById('configItem-designThemes')
    const hlweenHtml = `<div class="module-hlween module-timeEEWidget" id="${pumpkinId}"><?xml version="1.0" encoding="UTF-8"?>
        <?xml version="1.0" encoding="UTF-8"?>
        <svg id="PumpkinSVG" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 1200 1099.53">
          <g>
            <path d="M928.35,254.6c-86.41,0-150.59,10.86-194.07,22.2,60.9,110.37,15.35,135.52,15.35,135.52,0,0-18.35-73.14-85.78-110.06,0,0-67.68-67.84,4.82-194.08,19.04-33.15,50.3-61.08,88.65-39.28,16.44,9.34,26.6,26.28,43.32,34.62,19.11,9.53,41.77,8.2,62.14,4.22,9.68-1.89,16.64-10.38,16.64-20.24v-9.17c0-12.9-11.74-22.73-24.41-20.28-19,3.7-43.51,4.44-51.84-13.14-14.29-30.19-73.6-59.84-117.56-36.54-88.93,45.13-133.59,220-145.87,276.31-6.69-6.56-12.92-14.46-17.38-41.99-2.04-12.62-15.04-19.23-30.1-26.89-3.53-1.79-8.67-4.41-12.22-6.56,1.99-4.37,4.88-7.78,8.15-9.44,4.15-2.11,10.05-2.29,16.88-2.51,3.74-.12,7.6-.24,11.63-.7,17.58-1.98,36.98-13.5,38.03-34.11.68-13.3-7.08-23.61-12.97-30.21-7.52-8.42-11.29-16.04-14.94-23.41-7.24-14.64-15.44-31.24-48.37-31.24h-.2c-4.19.01-20.63,1.81-32.77,3.43-30.55,4.07-34.38,6.4-38.1,9.87-11.16,10.42-9.49,24.96-8.38,34.57.29,2.52.56,4.9.61,6.88.21,8.44-5.29,17.64-14.01,23.43-10.88,7.22-26.29,11.93-33.27,7.31-4.59-3.05-7.58-10.5-9.43-15.84-3.12-9.01-10.26-16.38-17.17-23.52-3.61-3.72-10.27-10.6-11.09-13.54.22-1.11,2.72-9.62,27.89-26.44,3.48-2.34,9.59-2.72,16.06-3.13,2.59-.16,5.25-.33,8-.63,21.26-2.3,30.24-13.19,34.03-21.92,8.1-18.62-1.54-41.97-13.26-57.63l-24.01,17.98c8.52,11.38,11.7,23.24,9.76,27.69-1.23,2.84-7.23,3.78-9.75,4.05-2.08.23-4.3.37-6.66.52-9.2.58-20.64,1.3-30.85,8.13-29.09,19.45-42.17,36.34-41.18,53.15.78,13.3,10.73,23.58,19.51,32.64,3.75,3.88,9.43,9.74,10.37,12.47,3.27,9.45,9.03,22.95,21.2,31.02,9.91,6.57,22.63,8.44,36.79,5.41,13.45-2.87,24.35-9.21,29.66-12.73,17.36-11.53,27.86-30.37,27.4-49.16-.08-3.32-.44-6.49-.8-9.56-.26-2.26-.64-5.62-.63-7.91,12.23-2.6,44.41-6.36,50.22-6.54h.08c7.1,0,11.9.97,14.27,2.88,2.38,1.92,4.5,6.22,7.19,11.66,3.89,7.87,9.22,18.64,19.45,30.09,5.12,5.73,5.42,8.11,5.39,8.71-.08,1.6-4.85,5.08-11.44,5.82-2.82.32-5.92.42-9.21.52-9.09.29-19.4.62-29.51,5.75-12.74,6.46-22.14,19.38-25.81,35.43-1.41,6.19-.43,15.42,12.28,24.2,5.04,3.48,11.42,6.73,17.58,9.86,4.44,2.26,11.45,5.82,14.63,8.12,6.57,37.37,18.15,48.47,27.51,57.44,1,.96,1.97,1.89,2.88,2.81-57.26,48.5-73.31,101.41-73.31,101.41,0,0-45.55-25.15,15.35-135.52-43.48-11.34-107.66-22.2-194.07-22.2C57.19,254.6,0,564.38,0,681.15s36.59,262.73,147.74,335.99c104.84,69.1,290.72,50.03,290.72,50.03,54.8,47.67,161.54,28.6,161.54,28.6,0,0,106.74,19.07,161.54-28.6,0,0,185.88,19.07,290.72-50.03,111.15-73.26,147.74-219.23,147.74-335.99s-57.19-426.55-271.65-426.55ZM600,644.27l70,139.99h-140l70-139.99ZM183.47,563.61c4.78-35.45,17.57-69.28,25.9-104.07,66.98,114.37,268.91,198.12,268.91,198.12,0,0-35.13,63.99-92.32,78.29-57.18,14.3-124.76,13.21-157.27,2.71-63.68-20.6-54.41-106.89-45.22-175.05ZM659.22,1001.32l-17.63-55.81c-2.71-8.58-10.68-14.41-19.67-14.41h-43.84c-8.99,0-16.96,5.83-19.67,14.41l-17.63,55.81c-101.78-21.12-304.68-79.55-363.85-217.05,1.08.69,69.91,45.39,195.98,74.85v29.39c0,9.71,6.77,18.1,16.25,20.15l83.24,18.07c12.86,2.78,25.01-7.02,25.01-20.17v-27.04c32.02,3.15,66.24,4.97,102.59,4.97s70.57-1.82,102.59-4.97v27.04c0,13.15,12.15,22.95,25.01,20.17l83.24-18.07c9.48-2.05,16.25-10.44,16.25-20.15v-29.39c126.07-29.46,194.9-74.16,195.98-74.85-59.17,137.5-262.07,195.93-363.85,217.05ZM971.31,738.66c-32.51,10.5-100.09,11.59-157.27-2.71-57.19-14.3-92.32-78.29-92.32-78.29,0,0,201.93-83.75,268.91-198.12,8.33,34.79,21.12,68.62,25.9,104.07,9.19,68.16,18.46,154.45-45.22,175.05Z"/>
          </g>
        </svg>
    </div>`
    const configPumpkinOnOffHtml = `
      <div class="configItem-content-row dFlex ">
        <div class="configItem-content-left">
          <p class="text-label text-margin--small">🎃 Kürbis</p>
        </div>
        <div class="configItem-content-right">
          <label class="switch">
            <input type="checkbox" class="" id="check_showModulePumpkin" checked/>
            <span class="switch_slider"></span>
        </label>
        </div>
    </div>`

  mainHtml.insertAdjacentHTML('beforeend', hlweenHtml)
  configItemDesign.insertAdjacentHTML('beforeend', configPumpkinOnOffHtml);

  const checkModulePumpkin = document.getElementById('check_showModulePumpkin')
  checkModulePumpkin.addEventListener('change', (e) => showHideEEWidget(e,pumpkinId,moduleStorage_preValueConfiguration+'_hlweenPumpkin'))

  // loadup
  if (lstorage_c_moduleHlweenPumkin === 'true') {
    if (document.getElementById(pumpkinId).classList.contains('dNone')) {
      document.getElementById(pumpkinId).classList.remove('dNone')
    }
    checkModulePumpkin.checked = true
  } else if (lstorage_c_moduleHlweenPumkin === 'false') {
    document.getElementById(pumpkinId).classList.add('dNone')
    checkModulePumpkin.checked = false
  }

  changeModuleEEWidgetHeightHandler()
}